{
    "23F-1-Identification of Pathogens in Image Library": "Background  \nSunburst Agribiotech Solutions , LLC  (SAS)  is located at Turlock, CA. We do plant/ soil/water diagnostics for \ndiseases caused by agronomically important plant pathogens. The specific activity will be using AI in identifying plant \npathogens from microscopic  images . \n \nProblem(s)  \nTo identify plant pathogens in a non -subjective manner using software  that is backed up by AI using the real images \nof the pathogen as seen under the microscope . \n \nObjectives  \nUse the pathogen images files and create an algorithm and a software program that can now be used to ID plant \npathogens .",
    "23F-2-Capstone Purchasing App": "Background   \nThe School  of Engineering  (SoE)  Instructional Lab Services  at UC Merced  provides support to Capstone \nstudents in terms of providing training and access to instructional equipment, specialized lab spaces, and handling \nCapstone purchasing requests.  \n \nProblem(s)  \nThe problem is to streamline the purchasing process for capstone teams which involves 1) submission of purchase \nrequests by capstone teams to the teaching faculty 2) review and approval of the purchase requests by teaching faculty \n3) tracking team budget/e xpenses for faculty to consider during the approval and 4) submission of the approved \npurchase requests to SoE Instructional Staff.  \n \nObjectives  \nThe objective of the project is to develop an APP to streamline the capstone purchasing process to get timely \napproval from the faculty and reduce the staff time. Complete capstone purchasing process involves:  \n1) Purchase request submission, approval, budget tracking, maintaining inventory of purchases.  \n2) Placing the order using CBS2/Oracle system.  \n3) Getting tracking/delivery updates to the Campus  \n4) Delivering the items to various teams  \n \nMinimum viable product should include the following items:  \n1) Submission of purchase requests by capstone teams to the teaching faculty: SoE Staff will provide a sample \npurchase request form along with data verification criteria for various fields. Once the form is submitted by a \nTeam, teaching faculty should be noti fied of the submission.  \n2) Tracking team budget/expenses for faculty to consider during the approval: Team’s expenses should be tracked \nagainst the allotted budget for each team. This information should be available to the teaching faculty with each \npurchase request submission.  \n3) Review and approval of the purchase requests by teaching faculty: Reminders should be sent to the faculty until \nthe approval process has been completed. If the request has been rejected, the reason for the rejection should be \ncommunicated back to the team along with suggestions from the faculty.  \n4) Submission of the approved purchase requests to SoE Instructional Staff: If the request has been approved, the \napproved purchase request form should be submitted to SoE staff for processing.  \n5) A running inventory of all the approved items should be available for SoE staff and teaching faculty to keep track \nof purchases and flag items for retrieval at the end of the semester.  \n \nAdd-ons: \n1) Placing the order using CBS2/Oracle system: This will require communication between APP and Oracle API \n(involves campus level permissions).  \n2) Getting tracking/delivery updates to the Campus: This will require getting relevant information using Oracle API \nbased on the Purchase Order number.  \n3) Delivering the items to various teams: This will require identifying the delivery boxes by scanning labels. Once the \nteam is identified, a custom message is sent to the team regarding the delivery place and time.  \n4) Making instructional equipment requests: The App should provide a way for student teams to make equipment \nrequests to the Instructional Team. The request should first be approved by the instructor before being routed to \nthe Instructional team (email will b e provided).  \n5) Making lab access requests: The App should provide a way for student teams to make lab space requests to \nInstructional Team. The request should first be approved by the instructor before being routed to the \nInstructional team (email will be provided).  \n6) Safety training report: The App should allow the instructor to upload student roster along with team information \n(team numbers, team members, roles). Each student should be able to upload their safety certificates to the app. \nThe App should be able to gene rate a report indicating which students have completed the training and which are \nstill pending .",
    "23F-3-Employee Coaching and Development Tracking Page": "Background  \nAs the preferred leader in temperature -controlled warehousing and logistics services, United States Cold Storage  \n(USCS)  offers highly reliable, cost -effective, and environmentally sustainable solutions for the frozen and refrigerated \nfood industries. Our approach is to build high -quality warehouses equipped with the newest, most efficient \nrefrigeration technology available  and engage strong local management teams who continuously measure and improve \nperformance.  \nUSCS manages more than 376 million cubic feet of temperature -controlled warehouse, and distribution space in \n42 facilities located across the United States. USCS is the third largest  public refrigerated warehousing  (PRW ) logistics \nprovider in North America and employs more than 3,500 service professionals. USCS also offers logistics and \ntransportation services. Our consolidation programs are the best in the U.S. - building full trucks from less than \ntruckload (LTL) shipments and helping our customers be more efficient. We have nationwide coverage and a flexible \ndistribution model that fits many business needs. Goods get to the market efficiently, consistently, and most \nimportantly - safely.  \nOur transportation management system  (TMS  interfaces with all USCS operating systems to access customer \norder information, deliver  electronic data interchange  (EDI) transactions sets and update reporting needs for every \nstage of the transportation management process . \n \nProblem(s)  \nThe current observations page on Performance Plus (USCS Labor Management System) is designed and aligned with \nan older process of performing coaching and observations. Over the last 6 years, with changes in customers and \nprocesses, there have been massive changes in observations and coaching processes. This demands a revamp of the \nobservation page in Performance Plus that assists the new coaching processes and efficient tracking.  \n \nObjectives  \nProvide a better and efficient coaching and observation tracker webpage to eliminate the need for manually tracking \nfollow -ups. This will be relevant to the new coaching process. This will give ability for the company to sustain the new \ncoaching process an d utilize it to make LMS proficient and promote a productive work environment.  \n \nStandard Features:   \n• Different display pages based on type of coaching (skill and behavioral).  \n• Drop down option for task type, date user, observer. Check marks for list of skills to select.  \n• Date drop down for follow -up date.  \n• Display interactive KTS (training documentation) with check marks.  \n• As each check mark gets selected, it gets quantified (score) based on skills, behavior, and safety.  \n• Option to attach any documents.  \n• Ability to link original (parent) observation if this is a follow -up using observation ID no.  \n• Once it is linked, the page should show the history from the previous one.  \nBonus Features:  \n• Provide analytics on based KTS score, performance correlation.  \n• Show trends from previous parent observations along the follow -up ones.  \n• SMS or email as reminder of the follow -up.",
    "23F-4-Data Clean -up Tool": "Background   \nAs the preferred leader in temperature -controlled warehousing and logistics services, United States Cold Storage  \n(USCS)  offers highly reliable, cost -effective, and environmentally sustainable solutions for the frozen and refrigerated \nfood industries. Our approach is to build high -quality warehouses equipped with the newest, most efficient \nrefrigeration technology available  and engage strong local management teams who continuously measure and improve \nperformance.  \nUSCS manages more than 376 million cubic feet of temperature -controlled warehouse, and distribution space in \n42 facilities located across the United States. USCS is the third largest  public refrigerated warehousing  (PRW ) logistics \nprovider in North America and employs more than 3,500 service professionals. USCS also offers logistics and \ntransportation services. Our consolidation programs are the best in the U.S. - building full trucks from less than \ntruckload (LTL) shipments and helping our customers be more efficient. We have nationwide coverage and a flexible \ndistribution model that fits many business needs. Goods get to the market efficiently, consistently, and most \nimportantly - safely.  \nOur transportation management system  (TMS interfaces with all USCS operating systems to access customer order \ninformation, deliver  electronic data interchange  (EDI) transactions sets and update reporting needs for every stage of \nthe transportation management process . \n \nProblem(s)  \nThe presence of large amounts of bad data which does not comply with the required format, currently not relevant \nand that has been entered into the warehouse management system  (WMS ) incorrectly and cannot be utilized for any \npurpose. This data always causes hinderance in many daily activities, become hurdles when the company transitions to \na new WMS and most importantly occupies huge amounts of memory in the server systems. A tool wh ich can help \nidentify this bad data, modify it to required format and delete gaps,  if necessary, can help resolve many of the \nforementioned issues . \n \nObjectives  \nObjective is to design and function tool that can help the company to identify and delete, modify, fix this bad data, \ngaps in data, and eliminate a large amount as per user requirement. This will reduce manual work related to fixing this \nbad data.    \n \nStandard features:  \n• Ability to read various formats of data (xml, csv, pdf etc.;) and display in rows and columns.  \n• Give the user the ability to define each row or column of data according to the user’s preference. And modify or \ndisplay the data that is not according to the defined parameters. Preferably in GUI for a layman to use it.  \n• Combine different sets of data of same format into one set and customize as per user requirements.  \n• Ability to export into different formats as per user needs.  \n \nBonus features:  \n• Identify duplicate data in different formats, errors such as wrong address format, punctuation , spellings, and \naddress styles. Filter the data and display the rows and columns with these discrepancies.  \n• Creating visuals from the data .",
    "23F-5-Camera to Robot Calibration": "Background  \nOmron Robotics and Safety Technologies , Inc. (ORT)  is an automation technology development company \nfocused on robotics design and manufacturing. Omron is the leader in the field of industrial automation with \noperations in over 40 countries and 150 locations worldwide. Our company is unique in that it devel ops new \nelectronics, mechanics, and software for an exceptionally broad spectrum of robotics - including Selective Compliance \nArticulated Robot Arm  (SCARA ), articulated, parallel link, cobots, and autonomous mobile robots - for the global \nmarket . \n \nProblem(s)  \nORT  designs and manufactures, among other things, non -mobile Robots, or Robotic ‘arms’. They are configured to \nrun with a PC controller that can also drive cameras and part moving equipment such as part feeders and conveyor \nbelts. The software that configures and runs on the PC and robot is called ACE (Automation Control Environment).   \nThese robotic arms can be used to move pieces from one part line to a different place (pick and place). To enable \nseamless object detection and precise robot positioning, the ACE software relies on camera -to-robot calibration. This \nprocess involves converting camera coordinate positions into the robot's own X -Y-Z coordinate system.   \nACE software system has the ability to locate objects in the real world using either 2 D or 3D cameras. In some \ninstances, the camera can be mounted to a part of the Robot’s arm.   \nACE requires the ability to obtain a robot  coordinate position from a position located in any newly obtained \nimage or point -cloud (Camera coordinate system). This ability is referred to as camera to robot calibration.  The \ncalibration procedure happens through a series of pictures from a given camera position and interactive robot arm tip \nreal world placements.  A real world “calibration object” (3 D printed piece) is in some cases placed in the images them \nand is easily recognized by ACE. The user moves the robot to touch the tip of the object. There are slightly different \ncalibration methods in use currently depending on if the camera is arm mounted, etc.    \nCurrently, there are some shortcomings to the process.  Calibration may need to be redone several times until a \nreasonable accuracy is achieved.  The user input is critical,  and errors are easily introduced. A lot of positioning is \ninvolved,  and the right positions must be chosen.   \nA single robot to world 3D translation is generated from the procedure. The precision of a given translation \nconversion may be off by several mm . \n \nObjectives  \nWe would like to improve the accuracy of the robot positions estimated from the camera by replacing the calibration \nmethod that does the conversion and/or the process to obtain it.  \nThe UC Merced team is embarking on an exciting opportunity to revolutionize the field of robotics by enhancing \ncamera -to-robot calibration for Omron's Industrial Fixed Position Robots, powered by the cutting -edge ACE \nsoftware. We are seeking passionate and  innovative students to collaborate with us in developing groundbreaking \nalgorithms and C# .dll files that will redefine the precision of robot positions estimated from camera inputs.  \nBy joining our team, you will have the chance to explore advanced techniques for calibrating camera vision \ncoordinates to robot coordinates, working with both 2D and 3D images/point clouds. This is a unique opportunity to \ndive into the fascinating world of  robotics, combining computer vision and automation to create real -world impact.  \nThroughout this collaborative project, you will work closely with industry experts from the ACE team, gaining \ninvaluable insights into the state -of-the-art technologies used in industrial robotics. Your contributions will be \ninstrumental in pushing the bou ndaries of calibration accuracy, revolutionizing the way robots perceive and interact \nwith their environment.  \nNot only will you have the chance to pioneer innovative solutions, but your work will also be evaluated for its \nprecision and usability. We aim to develop a calibration method that is not only highly accurate but also user -friendly, \nensuring seamless integ ration within the ACE software ecosystem.",
    "23F-6-WDTrainTrack": "Background   \nThe client is Western Digital  Corporation  (WDC) . Western Digital Corporation is an American computer hard disk \ndrive manufacturer and data storage company that provides cost -effective solutions for storing, generating, and \naccessing data. It designs, manufactures, and sells data technology products, in cluding storage devices, data center \nsystems, and cloud storage services. The client for this project is R&D global teams, located in different countries. \nThis project focuses on training management.  \n \nProblem(s)  \nThe limitations of current manual, labor -intensive training management methods result in suboptimal learning \noutcomes and inefficient use of resources. Commercial solutions often fall short due to lack of customization options \nand adaptability to specific organizational needs. Our proposed application provides a tailored solution that boosts the \nefficiency and effectiveness of training, ultimately impacting overall organizational performance. By automating and \ndigitizing training processes, we empower managers to devise custom training plans, automatically track progress, and \nprovide real -time upd ates, enabling quicker decision -making and resource allocatio n. \n \nObjectives  \nThe primary deliverable will be the fully functioning web -based application. This includes:  \n• User Interface (UI): A user -friendly, intuitive, and responsive web interface for employees, managers, and \nadministrators.  \n• Backend Server: A secure and efficient server setup to handle requests and provide services such as user \nmanagement, progress tracking, and notification management.  \n• Database: A well -structured database to store all relevant data.",
    "23F-7-DocGPT": "Background  \nSweep  designs big data workflow software that is used for processing different types of data such as images, text and \nmachine data. Using the Sweep API, a simple cloud -based data gathering platform for storing and analyzing time \nseries data in a scalable fashio n, we work with customers to provide custom workflow solutions. Large Language \nModels have the potential to change the landscape of what it means to be a knowledge worker and revolutionize the \nway we collect, analyze, and understand data.  \n \nProblem(s)  \nCompany knowledge is often times available only through PDFs within an internal internet. In many cases, when too \nmany PDFs exist, information can become lost due to the sheer volume of documents created by the company on a \nregular basis. We would like to develop a simple tool that will allow us to read the contents of a PDF  and create \nmachine readable text that summarizes the information in the document for further processing in a custom workflow. \nUsing a readily available open -source large language model or online API, you will develop a software tool that will \ninteract wit h either local PDF documents in a shared network filesystem or within a local web intranet.  \n \nObjectives  \nDevelop a JSON schema that summarizes the contents of the PDF  using a large language model. For example, if \npresented with a table on a page, attempt to transform that table into a JSON formatted table object. JSON Schema \ncan be predefined by the team. This includes defining what summary questions will need to be as ked to complete an \nanalysis of a PDF . Software workflow must be able to process at least 10 PDF s per minute. Must be able to query \ncompiled PDF  JSON data through a REST API. You’re  able to use either a locally hosted large language model or an \nonline API to generate the machine -readable JSON data.",
    "23F-8-Satellite Imagery Web Application": "Background  \nThe Morning Star Company’s subsidiary company , Gradient Crop Yield Solutions (Gradient) , provides technical \nservices to tomato, pistachio, and almond growers primarily in the California Central Valley.  One of these services is \ncrop health images. Previously, Gradient would provide crop health images to growers using drones. Unfortunately, a s \nthe number of acres Gradient covered grew, the expense in imaging increased exponentially as well. As a result, \nGradient moved to using satellite imagery to provide crop health images to growers. Even though the imaging cost \nwas reduced by switching to s atellite images, Gradient is looking to further reduce the cost by creating its own \nplatform to process and view images.  \n \nProblem(s)  \nCurrently, Gradient is hiring a third -party company, EOS, to download the dataset of the most recent publicly \navailable satellite imagery from Sentinel 2. EOS then uses a Keyhole Markup Language (KML) file, containing latitude \nand longitude coordinates, su bmitted by Gradient to find the grower fields in the satellite imagery data. Afterwards, \nEOS processes the images using band wavelength manipulation to create the popular crop health monitoring \nalgorithms such as NDVI and NDRE. After the images are process ed, they are displayed on a web platform for our \ngrowers to view the images.  \n \nObjectives  \nGradient Crop Yield Solutions is interested in creating a web platform that displays processed NDVI/NDRE images \nusing Sentinel 2 images. Grower fields will be mapped using a list of coordinates stored as a KML file. The ideal \ndesign would be a web platform  that accepts a KML file and returns the most recent processed Sentinel 2 satellite \nimage using the NDVI or NDRE algorithm. The web platform needs to have a front -end and back -end that interact \nwith each other. The front -end should have an option to upload  KML files, while the back end will process the file to \nget the most recent Sentinel 2 image.  After processing, the front -end should render a map with the most recent \nsatellite image overlayed on top of the map.",
    "23F-9-Bio-Secure Scheduler": "Background  \nAgrecom  provides a spectrum of solutions in the areas of water treatment and sanitation, targeting clients in \nagriculture, residential, and commercial sectors. However, this project is being sponsored by Agrecom as a community \nservice.  As a sponsor Agrecom has already communicated with county officials about this project and  will facilitate \nintroductions to all the necessary public agencies.  \n \nProblem(s)  \nThe majority of our customers have stringent biosecurity controls on the technician’s  ability to visit their site, and \nthen go to another site. Scheduling is manual, and time consuming . We have tried commercial solutions, but none can \nmanage the customer biosecurity restrictions, and the schedule has to be manually redone anyway.  \n \nObjectives  \nObjec tives of this project are as follows:  \n• Taking in a list of technicians, their capabilities, and customers and their job requests, create a weekly /monthly \nwork schedule that strictly follows biosecurity quarantine requirements.  \n• Taking into account expected job duration , suggest route optimization for each technician maximizing their day.  \n• Allow the addition of jobs to the schedule and suggest which technicians are quarantined enough to do the work, \nand what jobs could be impacted by it – shuffling the work and schedule as needed to fit it in.",
    "23F-10-PhoenixSync: Remote Firmware Management for IoT": "Background  \nTC IoT Solutions is the  Original Design Manufacturer  (ODM ) Services and Custom Device Lifecycle Management \nengine of Telit Cinterion , the Western leader in secure global digital transformation and Industrial IoT. The \ncompany’s secure -by-design products and services enable business operating in Security and Surveillance, Energy and \nUtilities, Telematics and Tracking, Healthcare and Wellness, and Mobile Broadband.   \n \nProblem(s)  \nThe IoT Solutions Business Unit is currently constrained by manual management of firmware -over-the-air (FOTA) \nupdates to customer IoT devices deployed in the field. These factors are limiting the business’ opportunities to service \nnew customers and harming the business’ reputation and bottom line. Whatever solution is adopted must be simple to \ndeploy, easy to use, and built to scale. It must be able to work within the existing environment.  \n \nObjectives  \nThe PhoenixSync Project Team will be tasked with the creation  of a robust and user -friendly web -based application to \ntrack devices and seamlessly manage FOTA updates. The application and visualization dashboard will offer a \ncomprehensive set of features to streamline the firmware update process, enhance security, and provide valuable \ninsights into de vice performance.",
    "23F-11-Virtual Warehouse": "Background  \nNutstar Software LLC  is a Merced based software company.  We have been building software for the Tree Nut \nIndustry for 15 years. We value our client base and want to continue to innovate technology to further improve the \nindustry and its efficiency.  \nProblem(s)  \nWe have created virtual warehouse software and technology that will allow for inventory to be handled  without \nhuman scanning. While we have engineered an initial product, it has proven to be costly and difficult to implement.  \nWe are planning to replace a portion of our technology with Bluetooth and gateway equipment.  \n \nObjectives  \nRequest to write a code in C# that tracks the Bluetooth asset tag (AoA  – Angle of Arrival -- Beacon/moving device) \nfrom an A oA Gateway (Locator/receiver/fixed position)  to a grid measured by feet (See reference “Hardware labels”  \nand “4x4 Grid”  in https://ucmerced.box.com/s/44n679xfchxbb27aqsj151z1jukmc5af ). The dimensions of the grid \ncan be of any length, as long as they are uniform.  \nPosition readings would come from an A oA Beacon to the A oA Locator, to which the data will be extracted and \npassed on to a PC (Windows 10/11 OS). The data extraction can be in string or int datatypes.  \nDevices are from Dusun, which has open -source code samples that includes API that can be used for this project.",
    "23F-12-Defect Detection on Silicon Wafer Using Neural Network": "Background  \nWestern Digital Corporation (WDC)  is an American computer drive manufacturer and data storage company, \nheadquartered in San Jose, California. It designs, manufactures,  and sells data technology products, including hard \ndrives and Flash Memory Solid State drives (SSD). SSD has been widely used in data centers, cell phones etc. Western \nDigital is one of the world’s  5 manufacturers  of Flash  memory. The Flash memory is silicon based nonvolatile storage \nwhich was manufactured in Japan.  Our Milpitas, CA facility is engaged in advanced technology development of flash \nmemory development and manufacture.  \n \nProblem(s)  \nWhen the silicon wafer is manufactured, there are thousands of different steps, such as etch and deposition, polishing \netc.  Every step has very sophisticated machines in high grade clean room.  But still many defects will be created \nbecause of dust or res idues of chemical materials.  Each defect will eventually result in electrical malfunction in the \nfinal products.  Therefore, it is very critical to detect the defects in every step of the process steps, instead of waiting \nuntil the wafer processing comple tion many months later.  But some defects are very hard to be detected by human \neyes due to the faint nature of the optical image.  This project is using advanced neural network model to make a delta \nimage by diff the defected image versus defect -less imag e. \n \nObjectives  \nThe students will be asked to use open -source  Regional Convolutional Neural Network (R -CNN) based deep learning \nto do image data processing. The main purpose is to identify very faint defects in the silicon wafer image.  In order to \nenhance the defect image, a diff image has to be made in comparison  to a perfect wafer image. The project  has three \nparts:",
    "23F-1-Generate ‘fake’ grayscale wafer images for training data: Currently, we use the real clean wafer image for this": "purpose, but it can be done computationally, and it will help to generalize our final model. This will be the \nminimum goal.",
    "23F-2-Add random defects and generate training labels for step 1.": "3. Train a U -net model to denoise the image. Again, we can add flexibility depending on the skill level. Students  can \nwrite it from scratch or  revise an open -source  code. We will give the specification for the final outcome.",
    "23F-13-Digital AI Backpack - Backpack Opportunities Crawler": "Background  \nStudents will work on a project that involves two companies: Conectado  and Linker Finance .  \nConectado is a venture revolutionizing approaches to Latino inclusion in STEAM, emphasizing technology. We \nare committed to empowering Latinos to succeed by building safer, simpler, and more sustainable connections from \nthe classroom to career to the board room. Conectado is a virtual platform that brings together educational \ninstitutions, social impact organizations, and private and public businesses, all working together to increase the \nrepresentation of Latinos in tech. At Conectado, users can access boot  camps and certifications that will allow them to \nreskill or upskill, connect with educational institutions and potential employers, develop a strategic network, meet \nmentors, and access career readiness resources.  \nLinker Finance is an embedded finance platform that expedites the launch of modern FinTech and Bank -like \nMobile and Web apps & services within weeks. The platform offers front -end Turnkey solutions, Front -End SDKs, \nand middleware with over 30+ integrations  for card issuing, deposits, bank connection, ID verification (KYC), \nbusiness verification (KYB), automatic money movement, financial insights, analytics, CRM, and more. We empower \ncompanies to unlock additional revenue streams and essential financial insi ghts, enabling them to deliver exceptionally \ntailored and personalized services.  \nFor this project, students will focus on our Digital AI Backpack project. The Digital AI Backpack seeks to create \na centralized, structured database of financial, educational, and professional opportunities that Conectado users can \naccess. Linker Finance i s developing an App that can allow Conectado users to access a centralized database of \nresources and opportunities available in the Conectado platform.  \n \nProblem(s)  \nThere is no centralized, standardized, structured database of opportunities for students, and they are all managed by \ndifferent organizations; some of them have APIs, some of them are posted in Content Management Systems, some \neven on an image or document format such as JPG and PDF. Coordinating this effort would be prohibitive, yet the \ninformation is available, making it an interesting task for applying AI methods.  \n \nObjectives  \nExtract and store inside a structured database a set of opportunities for students (i.e., internships, jobs, gigs, \nscholarships, grants), including important metadata such as name, description, URL for applying, application deadline \nor deadlines, and impor tant dates. The algorithm should also create meta tags relevant to the opportunity, which can \nbe later used by a recommender algorithm matching opportunities to specific students.  \nThis project is recommended for a student and/or group of students interested in Artificial Intelligence (AI) fields \nsuch as Text Recognition, OCR, LLMs (e.g., ChatGPT).",
    "23F-14-Taxiline Detection Using Machine Learning": "Background  \nOmron Robotics and Safety Technologies , Inc. (ORT)  is an automation technology development company \nfocused on robotics design and manufacturing. Omron is the leader in the field of industrial automation with \noperations in over 40 countries and 150 locations worldwide. Our company is unique in that it devel ops new \nelectronics, mechanics, and software for an exceptionally broad spectrum of robotics - including Selective Compliance \nArticulated Robot Arm  (SCARA ), articulated, parallel link, cobots, and autonomous mobile robots - for the global \nmarket . \n \nProblem(s)  \nOmron’s Autonomous Mobile Robots are connected to a central system called Fleet Manager (FM). The robots \nconnected to the same FM operate as a single fleet. These robots perform obstacle avoidance and intelligent \nmultirobot collision avoidance behaviors wh ile navigating on the map, by extensively sharing data among themselves.  \nTaxiline is a feature in these mobile robots’ navigation framework and runs on each individual robot every cycle. \nThe primary function of this feature is to determine whether the robot needs to re -path plan around a stopped robot \nin its path. The feature e nsures that if the leading robot is obstructed by an obstacle, the following robot that shares a \nsimilar path does not attempt to replan their path around the leading robot. Instead, it stops and waits for the leading \nrobot to move. When a fleet of robots share a similar path, they essentially start queuing up which forms a “Taxiline”. \nThe feature avoids unnecessary replanning that could result in chaotic behavior, and promotes efficient, cleaner and \norderly navigation.  \n \nObjectives  \nSo given all the required data, the Taxiline algorithm essentially finds out whether the given robot is taxilining with the \nrobot in the front and feeds  the result to the replanner. The existing algorithm, which is deterministic and rule -based, \nhas many unaddressed edge cases. To  handle all the edge cases and to improve the accuracy, we are considering a \nmachine learning based approach.  \n \n \nFollowing is a real example:  In the above picture, the paths for 5 robots are shown: Robot R1 (pink), R2 (red), R3 \n(yellow), R4 (green) and R5 (Orange). Ignore all other robots. R1 to R4, even though they are going to different final \ngoals, since their paths are similar, they all just  queue up behind one another without trying to replan around. But if \nyou look at R5, its original path (straight dotted orange line) is obstructed by R1 and it replans around R1 as R5 is not \n“Taxilining” with R1 i.e., R1’s path is not similar to R5’s.",
    "23F-15-Online Battery Discharge/ Charge Time Estimation": "Background  \nOmron Robotics and Safety Technologies , Inc. (ORT)  is an automation technology development company \nfocused on robotics design and manufacturing. Omron is the leader in the field of industrial automation with \noperations in over 40 countries and 150 locations worldwide. Our company is unique in that it devel ops new \nelectronics, mechanics, and software for an exceptionally broad spectrum of robotics - including Selective Compliance \nArticulated Robot Arm  (SCARA ), articulated, parallel link, cobots, and autonomous mobile robots - for the global \nmarket . \n \nProblem(s)  \nMobile robot charge/discharge time is an important parameter customers use to select a robotics supplier.  Our \ncurrent estimation method could be improved using data that can be gathered from the robot power station including:  \n• State of Charge  \n• Instantaneous Charge Current  \n• Instantaneous Discharge Current  \n• Remaining Battery Capacity  \n• Max/Min Temperature  \n \nObjectives  \nEstimate the remaining discharge time/charge time based on current as well as from the previous data.  \n• Multiple standard methods need to be identified both deterministic and probabilistic methods.  \n• These methods should be evaluated to identify the best estimation method.  \n• Limitations and assumptions associated with these methods should be established.  \nTest formulated method on batteries with different chemistry (Li -ion based)\"",
    "23F-16-Deadlock Prevention/ Recovery for Mobile Robot Fleets": "Background  \nOmron Robotics and Safety Technologies , Inc. (ORT)  is an automation technology development company \nfocused on robotics design and manufacturing. Omron is the leader in the field of industrial automation with \n\noperations in over 40 countries and 150 locations worldwide. Our company is unique in that it develops new \nelectronics, mechanics, and software for an exceptionally broad spectrum of robotics - including Selective Compliance \nArticulated Robot Arm  (SCARA ), articulated, parallel link, cobots, and autonomous mobile robots - for the global \nmarket . \n \nProblem(s)  \nA deadlock in a fleet of autonomous mobile robots (AMRs) refers to a situation where two or more robots are unable \nto move due to mutual blocking, which means each robot is blocking the path of another robot. This results in a state \nof the system where non e of the robots can move forward and continue their jobs, and the entire system is stuck in a \ndeadlock. When a deadlock happens in Omron AMRs, it requires manual intervention. This not only affects the \nproduction  cycle time and efficiency of the fleet, but it  also makes the “intelligent” robots look dumb.  \nDeadlock recovery is a mechanism used in robotics to resolve deadlocks by identifying them and taking \nappropriate actions, such as modifying the trajectories of one or more robots that are stuck in the deadlock.  \nDeadlock prevention is a mechanism where the deadlocks are predicted beforehand,  and the robots’ trajectories \nare modified in such a way that the deadlocks don’t happen in the first place. One other way to predict and prevent \ndeadlocks is to change the order of jobs that are picked by the robots.  \n \nObjectives  \nOmron team has already developed some algorithms to recover the robots out of a deadlock. But they don’t work for \nall the scenarios. Deadlock prevention is even a tougher problem and there’s no solution for it yet.  \nMachine Learning/Reinforcement learning is one option that Omron team is considering to recover the robots \nout of deadlocks.",
    "23F-17-Building a Database for Community and Mentors Engagement": "Background  \nINNOVIT  is the premier Italian Innovation and Culture Hub, promoted by Italy’s Ministry of Foreign Affairs and \nInternational Cooperation and coordinated by the Consulate General of Italy in San Francisco and the Embassy of \nItaly in Washington DC. Located in the h eart of San Francisco, INNOVIT embodies Italy’s long -term commitment \nto technological innovation and to strengthening ties with the Bay Area and the US ecosystem.  Through acceleration \nprograms, strategic partnerships, and international initiatives, INNOVI T connects the vital resources of Silicon Valley \nwith the best opportunities offered by Italian businesses. We are the bridge that links Italian excellence in \nentrepreneurship, culture, research, and technology to the global future.  INNOVIT designs and de livers acceleration \nand innovation services for Italian companies, startups, universities, and scientific centers.  \n \nProblem(s)  \nThis project is focusing on designing and building the INNOVIT community database, with a specific focus on \nmentors and community. The Mentors database is critical to deliver startup acceleration programs, while the \nCommunity Database is critical for launc hing marketing and engagement activities.  Without a well-designed  database \nthe operational activities of a strategic project like INNOVIT cannot run properly as the program is scaling rapidly.  \nDuring the last 6 months  alone, more than 3.000 people have joined +40 events, while more than 60 startups have \nparticipated in 2 acceleration programs involving more than 100 mentors.  \nNegotiable constraints are related to INNOVIT team support, data entry, deadlines,  and project expansion to \nother areas like Visitors registrations, Sales and Booking systems.  \nNon-negotiable  constraints  are mostly centered around users’  experience and key requirements.  \n \nObjectives  \nThe team is asked to perform interviews, requirements analysis, and implementation.  At the end of the semester,  we \nare expecting to have a fully implemented database with a user-friendly  UI.",
    "23F-18-CTTA Member Database Management and Automation": "Background  \nFounded in 1969, the California Tow Truck Association (CTTA)  represents professional towing operators \nstatewide. Created by and for towing company owners, CTTA provides unparalleled solutions and resources that \nempower towing companies to be more professional and progressive within the industry while serving the mo toring \npublic. The mission of the California Tow Truck Association is to cultivate a community of professionals able to \nprovide the highest caliber of towing and emergency road service -related solutions for the motoring public and the \ncommunities of our state.  \n \nProblem(s)  \nCurrently, our database system does not function appropriately to manage members, and the data  entered does not \ntransfer to our other systems. Data is lost and membership renewals and communications get lost.  \n \nObjectives  \nThe objective is to consolidate systems and have one central database that can host and manage members, member \nrenewals, and member communication all in one system that can be on our website. The task at hand is to develop \ntwo separate websites that will b e linked with one central database that has been built by last year’s  capstone team."
}